# -*- coding:utf-8 -*-
__author__ = 'gjw'
__time__ = '2018/1/19 0019 上午 11:05'

# 4-4 如何将多个小字符串拼接成一个大的字符串

"""
    方法一：迭代列表，连续使用"+"操作依次；拼接每一个字符串
"""
pl = ["<0112>", "<32>", "<1024x768>" , "<60>", "<1>", "<100.0>", "<500.0>"]
s = ''
for p in pl:
    s += p
print(s)


print()
print()

"""
    方法二：使用str.join()方法，更加快速的拼接列表中所有字符串
    推荐！！！！
"""
new = ''.join(pl)
print(new)


print()
print()
# 存在字符串和数字的列表
l = ['abc', 123, 45, 'xyz']
"""
使用列表解析有浪费
使用生成器表达式开销小
"""
newl = "".join(str(x) for x in l)
print(newl)